       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATOR.
       AUTHOR. NICOLO' MAFFI.
       INSTALLATION. AUTHOR'S PERSONAL COMPUTER.
       DATE-WRITTEN. 20/07/2023.
       DATE-COMPILED. 20/07/2023.
       SECURITY. SOURCE IS AVAILABLE ON GITHUB.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
           SOURCE-COMPUTER. UNIX-2.
           OBJECT-COMPUTER. UNIX-2
               MEMORY SIZE 8589934592 CHARACTERS.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           77 OPERATION PIC A(4) VALUE IS SPACES.
               88 ADD-OP     VALUE "ADD".
               88 SUB-OP     VALUE "SUB".
               88 MUL-OP     VALUE "MUL".
               88 DIV-OP     VALUE "DIV".
               88 INT-DIV-OP VALUE "IDIV".
               88 POW-OP     VALUE "POW".
               88 ROOT-OP    VALUE "ROOT".
           77 FIRST-N  PIC S9(19)V9(19) VALUE IS ZEROS.
           77 SECOND-N PIC S9(19)V9(19) VALUE IS ZEROS.
           77 MEM      PIC S9(19)V9(19) VALUE IS ZEROS.
       PROCEDURE DIVISION.
       MAIN.
           DISPLAY "CO.B.O.L. CALCULATOR"
           DISPLAY " "

           PERFORM WITH TEST AFTER UNTIL OPERATION IS EQUALS TO "INT"
               DISPLAY "> " WITH NO ADVANCING
               ACCEPT OPERATION
               EVALUATE TRUE
                   WHEN ADD-OP     PERFORM ADD-F
                   WHEN SUB-OP     PERFORM SUB-F
                   WHEN MUL-OP     PERFORM MUL-F
                   WHEN DIV-OP     PERFORM DIV-F
               END-EVALUATE
           END-PERFORM.
       STOP RUN.

       ADD-F.
           DISPLAY "NUM 1> " WITH NO ADVANCING
           ACCEPT FIRST-N

           DISPLAY "NUM 2> " WITH NO ADVANCING
           ACCEPT SECOND-N

           ADD FIRST-N TO SECOND-N GIVING MEM

           DISPLAY FIRST-N " + " SECOND-N " = " MEM.

       SUB-F.
           DISPLAY "NUM 1> " WITH NO ADVANCING
           ACCEPT FIRST-N

           DISPLAY "NUM 2> " WITH NO ADVANCING
           ACCEPT SECOND-N

           SUBTRACT SECOND-N FROM FIRST-N GIVING MEM

           DISPLAY FIRST-N " - " SECOND-N " = " MEM.

       MUL-F.
           DISPLAY "NUM 1> " WITH NO ADVANCING
           ACCEPT FIRST-N

           DISPLAY "NUM 2> " WITH NO ADVANCING
           ACCEPT SECOND-N

           MULTIPLY FIRST-N BY SECOND-N GIVING MEM

           DISPLAY FIRST-N " * " SECOND-N " = " MEM.

       DIV-F.
           DISPLAY "NUM 1> " WITH NO ADVANCING
           ACCEPT FIRST-N

           DISPLAY "NUM 2> " WITH NO ADVANCING
           ACCEPT SECOND-N

           IF SECOND-N IS EQUALS TO ZERO THEN
               DISPLAY "THIS UNIT CANNOT COMPUTE ZERO DIVISIONS!"
           ELSE
               DIVIDE FIRST-N BY SECOND-N GIVING MEM

               DISPLAY FIRST-N " / " SECOND-N " = " MEM
           END-IF.
