       IDENTIFICATION DIVISION.
       PROGRAM-ID.    HELLO-WORLD.
       AUTHOR.        Nicolo' Maffi.
       DATE-WRITTEN.   3 jan 2021.
       DATE-COMPILED.  3 jan 2021.
       PROCEDURE DIVISION.
           DISPLAY "Hello World!"
           STOP RUN.
       END PROGRAM HELLO-WORLD.
