       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBOL-SQLITE-CALLBACK.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WS-ID-COLUMN     PIC 99    BASED.
       77 WS-NAME-COLUMN   PIC X(30) BASED.
       LINKAGE SECTION.
       77 PTR              POINTER.
       77 NUM-COLUMNS      PIC S9(9).
       01 COL-VALUES.
           02 ID-COLUMN    POINTER.
           02 NAME-COLUMN  POINTER.
       77 COL-NAME         POINTER.
       PROCEDURE DIVISION USING PTR, NUM-COLUMNS,
           BY REFERENCE COL-VALUES, BY REFERENCE COL-NAME.

           SET ADDRESS OF WS-ID-COLUMN TO ID-COLUMN
           SET ADDRESS OF WS-NAME-COLUMN TO NAME-COLUMN

           DISPLAY WS-ID-COLUMN " | " WS-NAME-COLUMN
           EXIT PROGRAM.
       END PROGRAM COBOL-SQLITE-CALLBACK.
